b-straub/CriticalInfrastructure/bootloader-build/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SECURE_BOOT=y
CONFIG_SECURE_BOOT_V2_ENABLED=y
CONFIG_SECURE_BOOT_SIGNING_KEY="/Users/berni/Projects/CriticalInfrastructure/keys/secure_boot_signing_key.pem"
CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y
CONFIG_SECURE_FLASH_ENC_ENABLED=y
CONFIG_SECURE_FLASH_ENCRYPTION_MODE_DEVELOPMENT=y
CONFIG_PARTITION_TABLE_OFFSET=0x10000
